<?php
$lang['invalid_characters'] = 'Символи, такі як %s не дозволені в полі %s';
$lang['green'] = 'Зелений';
$lang['yellow'] = 'Жовтий';
$lang['red'] = 'Червоний';
$lang['item'] = 'Елемент';
$lang['items'] = 'Елементи';
$lang['fielddef'] = 'Поле';
$lang['fielddefs'] = 'Типи полів';
$lang['template'] = 'Шаблон';
$lang['templates'] = 'Шаблони';
$lang['category'] = 'Категорія';
$lang['categories'] = 'Категорії';
$lang['option'] = 'Параметр';
$lang['options'] = 'Параметри';
$lang['maintenance'] = 'Підтримка';
$lang['back'] = 'Повернутися на сторінку назад';
$lang['about'] = 'Довідка';
$lang['whatsnew'] = 'Що нового';
$lang['prompt_fix_fielddefs'] = 'Спроба відновити поля з бази даних';
$lang['message_fielddefs_fixed'] = 'Поля для всіх екземплярів модуля відновлено.';
$lang['message_instances_copied'] = 'Всі екземпляри продубльовано.';
$lang['item_title'] = 'Заголовок';
$lang['prompt_item_title'] = 'Заголовок елемента';
$lang['prompt_of'] = 'з';
$lang['active'] = 'Активний';
$lang['create_time'] = 'Дата створення';
$lang['modified_time'] = 'Дата зміни';
$lang['time_control'] = 'Використовувати контроль часу';
$lang['start_time'] = 'Час початку';
$lang['end_time'] = 'Час закінчення';
$lang['item_title_empty'] = 'Не заповнено заголовок елемента';
$lang['required_field_empty'] = 'Не заповнено обов\'язкове поле';
$lang['too_long'] = 'Значення поля перевищує максимальну довжину';
$lang['approve'] = 'Встановити статус \'Активний\'';
$lang['revert'] = 'Встановити статус \'Неактивний\'';
$lang['toggle_status'] = 'Перемкнути статус';
$lang['select_item'] = 'Вибрати елемент';
$lang['submit_order'] = 'Зберегти порядок';
$lang['delete_selected'] = 'Видалити вибране %s';
$lang['areyousure_deletemultiple'] = 'Ви впевнені, що хочете видалити все це %s?';
$lang['select_all'] = 'Вибрати все';
$lang['error_startgreaterend'] = 'Дата початку більша, ніж дата закінчення';
$lang['item_alias_exists'] = 'Такий псевдонім елемента вже існує. Псевдонім має бути унікальним.';
$lang['return_url'] = 'Повернутися';
$lang['pathcontainsvars'] = 'Це поле можна редагувати після першого збереження цього %s';
$lang['url'] = 'Виберіть власну URL-адресу для цього елемента або підтвердіть згенеровану';
$lang['item_var_help_item_id'] = 'Якщо задано item_id, очікується, що елементи вже існують в базі даних. Якщо ви імпортуєте нові елементи, ігноруйте це поле.';
$lang['item_var_help_category_id'] = 'Якщо задано category_id, елементу буде призначено цю категорію. Якщо category_id задано, але її не існує, вона ігнорується, а замість цього використовується категорія за замовчуванням.';
$lang['item_var_help_title'] = 'Заголовок елемента, який відображається в URL-адресі та описує елемент.';
$lang['item_var_help_alias'] = 'Псевдонім елемента використовується для надання елементу зручного і зрозумілого короткого імені. Псевдонім унікальний для кожного елемента.';
$lang['item_var_help_url'] = 'Власна URL-адреса для елемента. Має бути унікальною для кожного елемента та системи.';
$lang['item_var_help_position'] = 'Ви можете встановити позицію елементів, яка визначає їх порядок відображення.';
$lang['item_var_help_active'] = 'Цей параметр встановить елемент активним або неактивним.';
$lang['item_var_help_start_time'] = 'Встановити час, з якого цей елемент буде відображатися.';
$lang['item_var_help_end_time'] = 'Встановити час, до якого цей елемент буде відображатися.';
$lang['item_var_help_owner'] = 'Виберіть ID адмін. користувача для цього елемента, щоб встановити власника.';
$lang['item_var_help_key1'] = 'Встановити додатковий ідентифікатор \'key1\' для цього елемента.';
$lang['item_var_help_key2'] = 'Встановити додатковий ідентифікатор \'key2\' для цього елемента.';
$lang['item_var_help_key3'] = 'Встановити додатковий ідентифікатор \'key3\' для цього елемента.';
$lang['main_settings'] = 'Основні налаштування';
$lang['editfielddef'] = 'Редагувати поле';
$lang['fielddef_name'] = 'Назва';
$lang['fielddef_help'] = 'Корисна порада';
$lang['fielddef_type'] = 'Тип';
$lang['fielddef_deps'] = 'Залежності модуля';
$lang['fielddef_deps_missing'] = 'Одна або декілька залежностей модуля відсутні. Будь ласка, встановіть всі необхідні модулі, щоб почати користуватися цим полем.';
$lang['fielddef_scan'] = 'Знайти всі типи полів';
$lang['fielddef_scanned'] = 'Типи полів проскановано';
$lang['fielddef_type_notset'] = 'Тип поля не встановлено';
$lang['fielddef_friendlytype'] = 'Дружні типи';
$lang['fielddef_originator'] = 'Ініціатор';
$lang['fielddef_max_length'] = 'Максимальна довжина';
$lang['fielddef_required'] = 'Обов\'язкове';
$lang['registered_fielddefs'] = 'Всі доступні типи полів';
$lang['fielddef_name_empty'] = 'Не заповнено назву поля';
$lang['fielddef_name_exists'] = 'Така назва поля вже існує';
$lang['fielddef_alias_exists'] = 'Такий псевдонім поля вже існує. Псевдонім має бути унікальним.';
$lang['fielddef_is_unique'] = 'Це поле унікальне, у вас не може бути їх більше одного.';
$lang['fielddef_image'] = 'Очікується зображення';
$lang['invalid'] = 'Значення поля недійсне';
$lang['status_required'] = 'Встановити статус \'обов\'язкове\'';
$lang['status_optional'] = 'Встановити статус \'необов\'язкове\'';
$lang['is_default'] = 'Встановлено за замовчуванням';
$lang['status_default'] = 'Встановити за замовчуванням';
$lang['helptext_title'] = 'Доступні типи полів для додаткового поля:';
$lang['fielddef_template'] = 'Шаблон';
$lang['field_search_index'] = 'Дозволити індексування цього поля основним модулем пошуку системи';
$lang['prompt_reindex_do_search'] = 'Переіндексувати все (або видалити вже проіндексоване, якщо не відмічено попереднє поле) - одноразово';
$lang['fielddef_search_index_help'] = 'Позначення цього поля дозволить індексувати це поле основним модулем пошуку системи, коли ви створюєте, змінюєте елементи, або вибрали "Переіндексувати все"';
$lang['warning_reindex_search_now'] = 'Зауважте, що це може зайняти багато часу, залежно від кількості записів.';
$lang['warning_reindex_search'] = 'Зверніть увагу, хоч цей модуль не призначений для великої кількості елементів, відомо, що деякі сервери достатньо ефективно зберігають і обробляють десятки тисяч елементів разом з великою кількістю додаткових полів. Тому повідомляємо, що  індексування даних цього модуля основним модулем пошуку системи може бути ефективним тільки з елементами в кількості сотень записів, а не тисяч. Якщо ви плануєте використовувати величезну кількість записів, пам\'ятайте, що індексування та сам пошук можуть бути дуже повільними, тому ви повинні використовувати вбудовану в цей модуль функцію пошуку, оскільки вона оптимізована для цих випадків.';
$lang['fielddef_TextInput'] = 'Поле для тексту';
$lang['fielddef_Checkbox'] = 'Прапорець';
$lang['fielddef_TextArea'] = 'Текстова область';
$lang['fielddef_SelectDate'] = 'Вибрати дату';
$lang['fielddef_SelectDateTime'] = 'Вибрати дату та час';
$lang['fielddef_dt_backwards_compatibility'] = 'Зворотна сумісність';
$lang['fielddef_dt_fielddef_backwards_compatibility_help'] = 'Позначте це поле для продовження користування старим форматом дати та часу бази даних';
$lang['fielddef_Dropdown'] = 'Випадаючий список';
$lang['fielddef_ContentPages'] = 'Сторінки';
$lang['fielddef_SelectFile'] = 'Вибрати файл';
$lang['fielddef_RadioGroup'] = 'Група радіо-кнопок';
$lang['enable_jqui'] = 'Використовувати кнопки jQueryUI';
$lang['fielddef_Slider'] = 'Повзунок';
$lang['fielddef_MultiSelect'] = 'Поле мульти-вибору';
$lang['fielddef_CheckboxGroup'] = 'Група прапорців';
$lang['fielddef_FileUpload'] = 'Поле вивантаження файлу';
$lang['fielddef_ColorPicker'] = 'Поле вибору кольору';
$lang['fielddef_Tags'] = 'Теґи';
$lang['fielddef_Tabs'] = 'Вкладка';
$lang['fielddef_BackendText'] = 'Текст в адмін. панелі';
$lang['fielddef_BT_container_div'] = 'Блок DIV';
$lang['fielddef_BT_container_div_help'] = 'Це базові CSS-стилі, призначені для адмін. панелі CMSMS';
$lang['fielddef_BT_container_text'] = 'Текст';
$lang['fielddef_BT_container_text_help'] = 'Текст для відображення на адмін. панелі';
$lang['fielddef_BT_information'] = 'Інформація';
$lang['fielddef_BT_warning'] = 'Попередження';
$lang['fielddef_FEUDropdown'] = 'Випадаючий список FrontEndUsers';
$lang['fielddef_feu_options'] = 'Групи FEU';
$lang['fielddef_feu_dropdown_help'] = 'Будь ласка, виберіть одну з доступних груп FrontEndUsers';
$lang['fielddef_GalleryDropdown'] = 'Випадаючий список для вибору галереї';
$lang['fielddef_GBFilePicker'] = 'Поле вивантаження файлу GBFilePicker';
$lang['fielddef_GBFilePicker_filebrowser'] = 'Увімкнути файловий браузер';
$lang['fielddef_GBFilePicker_image'] = 'Очікується зображення';
$lang['fielddef_GBFilePicker_create_dirs'] = 'Дозволити створення теки';
$lang['fielddef_GBFilePicker_delete'] = 'Дозволити видалення';
$lang['fielddef_GBFilePicker_show_subdirs'] = 'Дозволити підтеки';
$lang['fielddef_GBFP_allow_help'] = 'Вкажіть список дозволених розширень файлів через кому. Наприклад: pdf, gif, jpeg, jpg (пишіть у нижньому регістрі)';
$lang['fielddef_GBFP_dir_help'] = 'Шлях до теки, який буде додано до $config[\'uploads_url\'] . У кінці немає бути косої риски.';
$lang['fielddef_GBFP_exclude_prefix_help'] = 'Вкажіть через кому список префіксів, щоб виключити файли, що починаються з вказаного префіксу. Наприклад: thumb_, foo_';
$lang['fielddef_GBFP_filebrowser_help'] = 'За замовчуванням буде використано випадаючий список. Увімкнути файловий браузер, якщо користувач може переглядати файли.';
$lang['fielddef_GBFP_media_type_help'] = 'Дозволяє вказувати зображення як тип медіа, який буде відображатися. За замовчуванням будуть відображатися всі файли.';
$lang['fielddef_GBFP_delete_help'] = 'Якщо цей параметр увімкнено, ви можете дозволити видалення файлів чи тек для цього поля навіть користувачам без відповідного дозволу.';
$lang['fielddef_GBFP_create_dirs_help'] = 'Якщо цей параметр увімкнено, ви можете дозволити створення тек для цього поля навіть користувачам без відповідного дозволу.';
$lang['fielddef_GBFP_show_subdirs_help'] = 'Якщо цей параметр увімкнено, користувач може переглядати підтеки.';
$lang['fielddef_JMFilePicker'] = 'Поле вивантаження файлуJMFilePicker';
$lang['fielddef_JMFilePicker_filebrowser'] = 'Увімкнути файловий браузер';
$lang['fielddef_JMFilePicker_image'] = 'Очікується зображення';
$lang['fielddef_JMFilePicker_create_dirs'] = 'Дозволити створення теки';
$lang['fielddef_JMFilePicker_delete'] = 'Дозволити видалення';
$lang['fielddef_JMFilePicker_show_subdirs'] = 'Дозволити підтеки';
$lang['fielddef_JMFP_allow_help'] = 'Вкажіть список дозволених розширень файлів через кому. Наприклад: pdf, gif, jpeg, jpg (пишіть у нижньому регістрі)';
$lang['fielddef_JMFP_dir_help'] = 'Шлях до теки, який буде додано до $config[\'uploads_url\'] . У кінці немає бути косої риски.';
$lang['fielddef_JMFP_exclude_prefix_help'] = 'Вкажіть через кому список префіксів, щоб виключити файли, що починаються з вказаного префіксу. Наприклад: thumb_, foo_';
$lang['fielddef_JMFP_filebrowser_help'] = 'За замовчуванням буде використано випадаючий список. Увімкнути файловий браузер, якщо користувач може переглядати файли.';
$lang['fielddef_JMFP_media_type_help'] = 'Дозволяє вказувати зображення як тип медіа, який буде відображатися. За замовчуванням будуть відображатися всі файли.';
$lang['fielddef_JMFP_delete_help'] = 'Якщо цей параметр увімкнено, ви можете дозволити видалення файлів чи тек для цього поля навіть користувачам без відповідного дозволу.';
$lang['fielddef_JMFP_create_dirs_help'] = 'Якщо цей параметр увімкнено, ви можете дозволити створення тек для цього поля навіть користувачам без відповідного дозволу.';
$lang['fielddef_JMFP_show_subdirs_help'] = 'Якщо цей параметр увімкнено, користувач може переглядати підтеки.';
$lang['fielddef_CustomFromUDT'] = 'Додаткове поле з теґу користувача (UDT)';
$lang['fielddef_type_help'] = 'Вибрати тип цього поля';
$lang['fielddef_source_udt'] = 'Теґ користувача (UDT) - джерело';
$lang['fielddef_source_UDT_help'] = 'Вибрати теґ користувача (UDT) - джерело';
$lang['fielddef_validation_udt'] = 'Теґ користувача (UDT) для валідації';
$lang['fielddef_validation_UDT_help'] = 'Вибрати теґ користувача (UDT) для валідації (не обов\'язково)';
$lang['fielddef_render_for_admin_listing_udt'] = 'Вибрати теґ користувача (UDT) з списку для адміністраторів';
$lang['fielddef_render_for_admin_listing_UDT_help'] = 'Вибрати теґ користувача (UDT) для валідації (не обов\'язково)';
$lang['fielddef_LISEInstance'] = 'Екземпляр модуля LISE';
$lang['fielddef_LISEInstanceItem'] = 'Елемент екземпляру модуля LISE';
$lang['fielddef_instance_help'] = 'Вибрати екземпляр';
$lang['fielddef_identifier_help'] = 'Виберіть ідентифікатор бази даних';
$lang['instance'] = 'Екземпляр';
$lang['identifier'] = 'Ідентифікатор';
$lang['fielddef_FEUMultiSelect'] = 'Поле мульти-вибору FEU';
$lang['fielddef_JQueryMultiSelect'] = 'Поле мульти-вибору JQuery';
$lang['fielddef_feu_multiselect_help'] = 'Будь ласка, виберіть одну або декілька доступних груп FrontEndUsers';
$lang['fielddef_feu_fields_help'] = 'Будь ласка, виберіть додаткове поле з FEU, з якого буде згенеровано значення, яке буде показано у полі вибору.<br>Зверніть увагу, що вибране поле повинно мати унікальні значення у всіх записах користувачів FEU.';
$lang['fielddef_feu_fields'] = 'Вибрати перше поле FEU';
$lang['fielddef_feu_fields2'] = 'Вибрати друге поле FEU';
$lang['fielddef_users'] = 'Користувачі';
$lang['fielddef_use_username'] = 'Використовувати поле "Ім\'я користувача"';
$lang['fielddef_use_uid'] = 'Додати ID користувача спереду';
$lang['fielddef_use_uid_help'] = 'Додати ID користувача спереду до параметрів у форматі [n].';
$lang['fielddef_use_username_help'] = 'Якщо ви позначите цей параметр, додаткові поля нижче не будуть використовуватися.';
$lang['fielddef_separator_chr'] = 'Розділовий знак';
$lang['fielddef_separator_chr_help'] = 'Символ, який використовується для відокремлення поля 1 і поля 2 у тексті опцій. За замовчуванням це пробіл.';
$lang['fielddef_FEUSingleSelect'] = 'Поле вибору одного FEU';
$lang['fielddef_CoreFilePicker'] = 'Поле вибору файлу';
$lang['fielddef_core_fp_profiles'] = 'Профіль';
$lang['fielddef_core_fp_profiles_help'] = 'Вибрати профіль Поля вибору файлів. Він повинен існувати! Не вибравши нічого або вибравши не існуючий, буде скинуто до профіля за замовчуванням або до значення за замовчуванням.';
$lang['fielddef_allow_help'] = 'Вкажіть список дозволених розширень файлів через кому. Наприклад: pdf, gif, jpeg, jpg (пишіть у нижньому регістрі)';
$lang['fielddef_dir_help'] = 'Шлях до теки, який буде додано до $config[\'uploads_url\'] . У кінці немає бути косої риски. {$item_id} і {$field_id} буде замінено.';
$lang['fielddef_exclude_prefix_help'] = 'Вкажіть через кому список префіксів, щоб виключити файли, що починаються з вказаного префіксу. Наприклад: thumb_, foo_';
$lang['fielddef_multioptions_help'] = 'Кожна опція повинна бути в окремому рядку. Значення можна відділити від тексту за допомогою символу =. Наприклад: Banana=banana';
$lang['fielddef_separator_help'] = 'Може бути порожнім, одним символом або HTML-елементом.';
$lang['fielddef_size_help'] = 'Вкажіть розмір поля введення. Наприклад: 20';
$lang['fielddef_max_length_help'] = 'Вкажіть максимальну довжину поля. Наприклад: 255';
$lang['fielddef_date_format_help'] = 'Вкажіть формат дати, що використовує поле вибору дати jQuery. Спробуйте <em>поґуґлити</em> \'jquery formatDate\'. Наприклад: dd-mm-yy';
$lang['fielddef_format_type_help'] = 'Вкажіть формат виводу для цього поля.';
$lang['fielddef_show_seconds_help'] = 'Вкажіть, чи слід відображати повзунок секунд. ЗВЕРНІТЬ УВАГУ, другий повзунок не має впливу, якщо формат часу неправильний. Спробуйте HH:mm:ss';
$lang['fielddef_time_format_help'] = 'Вкажіть формат дати, який використовує поле вибору часу jQuery. Спробуйте поґуґлити \'jquery formatTime\'. Наприклад: HH:mm';
$lang['fielddef_wysiwyg_help'] = 'Якщо позначено, для цього поля буде активовано візуальний редактор.';
$lang['fielddef_min_value_help'] = 'Вкажіть мінімальне значення для цього поля.';
$lang['fielddef_max_value_help'] = 'Вкажіть максимальне значення для цього поля.';
$lang['fielddef_increment_by_help'] = 'Визначте крок збільшення/зменшення для повзунка. Крок за замовчуванням - 1.';
$lang['fielddef_width_help'] = 'Вкажіть ширину елемента. Це може бути відсоткове або піксельне значення. Це буде використано як значення CSS.';
$lang['fielddef_subtype_help'] = 'Виберіть підтип для цього поля, щоб визначити його поведінку.';
$lang['fielddef_showall_help'] = 'Показати все, незалежно від дозволів системи.';
$lang['fielddef_columns_help'] = 'Кількість стовпців. Розділіть це поле на декілька стовпців для покращення зручності користування.';
$lang['fielddef_media_type_help'] = 'Дозволяє вказувати зображення як тип медіа, який буде відображатися. За замовчуванням будуть відображатися всі файли.';
$lang['fielddef_enable_jqui_help'] = 'Покращує стандартні елементи форми, урізноманітюючи дизайн кнопок із відповідним виглядом при наведенні мишою та під час кліку.';
$lang['reorder_categories'] = 'Змінити порядок категорій';
$lang['edit_category'] = 'Редагувати категорію';
$lang['category_name'] = 'Назва категорії';
$lang['category_description'] = 'Опис категорії';
$lang['category_name_empty'] = 'Не заповнено назву категорії';
$lang['category_alias_exists'] = 'Такий псевдонім категорії вже існує. Псевдонім має бути унікальним.';
$lang['archivetemplate'] = 'Шаблон архіву';
$lang['archivetemplates'] = 'Шаблони архіву';
$lang['categorytemplate'] = 'Шаблон категорій';
$lang['categorytemplates'] = 'Шаблони категорій';
$lang['summarytemplate'] = 'Шаблон списку елементів';
$lang['summarytemplates'] = 'Шаблони списку елементів';
$lang['detailtemplate'] = 'Шаблон виводу елемента';
$lang['detailtemplates'] = 'Шаблони виводу елемента';
$lang['searchtemplate'] = 'Шаблон для пошуку';
$lang['searchtemplates'] = 'Шаблони для пошуку';
$lang['filtertemplate'] = 'Шаблон виводу фільтра';
$lang['filtertemplates'] = 'Шаблони виводу фільтра';
$lang['edittemplate'] = 'Редагувати шаблон';
$lang['template_name'] = 'Назва шаблону';
$lang['template_name_empty'] = 'Не заповнено назву шаблону';
$lang['template_content_empty'] = 'Не заповнено вміст шаблону';
$lang['default_templates'] = 'Шаблони за замовчуванням';
$lang['module_options'] = 'Опції модуля';
$lang['url_options'] = 'Опції URL';
$lang['default_options'] = 'Модуль за замовчуванням';
$lang['xmodule_options'] = 'Опції перехресного модуля';
$lang['prompt_friendlyname'] = 'Гарне ім\'я модуля';
$lang['prompt_moddescription'] = 'Опис керування модулем';
$lang['prompt_adminsection'] = 'Розділ адмін. панелі, в якому розміщено модуль';
$lang['items_options'] = 'Опції елементів';
$lang['prompt_item_singular'] = 'Елемент в однині';
$lang['prompt_item_plural'] = 'Елемент в множині';
$lang['prompt_url_prefix'] = 'Префікс URL';
$lang['prompt_url_template'] = 'Шаблон URL';
$lang['prompt_display_inline'] = 'Відображати результати вбудовано (замінює теґ модуля замість {content})';
$lang['prompt_subcategory'] = 'Увімкнувши параметр підкатегорії, буде показано дочірні елементи категорії та її підкатегорій';
$lang['prompt_item_cols'] = 'Відображати ці поля в перегляді елементів';
$lang['prompt_items_per_page'] = 'Відображати елементи на сторінці';
$lang['prompt_create_date'] = 'Відображати дату створення елемента в режимі редагування?';
$lang['prompt_detailpage'] = 'Сторінка для виводу елемента';
$lang['prompt_summarypage'] = 'Сторінка для виводу списку елементів';
$lang['prompt_reindex_search'] = 'Елементи доступні для пошуку пошуковим модулем';
$lang['text_sortorder'] = 'Порядок сортування елементів за замовчуванням';
$lang['options_notice'] = 'Після зміни гарного імені модуля або розділу адмін. панелі, в якому розміщено модуль, можливо потрібно буде очистити кеш, щоб зміни вступили в силу.';
$lang['prompt_allow_autoscan'] = 'Дозволити системі автоматично сканувати поля';
$lang['notice_allow_autoscan'] = 'Дозволивши системі автоматичне сканування подій ModuleInstalled, ModuleUpgraded, ModuleUninstalled і ContentPostCompile можлива дивна поведінка з деякими основними версіями.';
$lang['prompt_allow_autoinstall'] = 'Дозволити системі встановлювати екземпляри автоматично';
$lang['prompt_allow_autoupdate'] = 'Дозволити системі оновлювати екземпляри автоматично, коли LISE оновлено';
$lang['misc_options'] = 'Різне';
$lang['prompt_auto_upgrade'] = 'Дозволити системі оновлювати цей екземпляр автоматично, коли LISE оновлено';
$lang['notice'] = 'Зверніть увагу';
$lang['instances'] = 'Екземпляри';
$lang['installed_instances_warning'] = 'Нижче наведено список дубльованих екземплярів модулів.<br/> Перед оновленням обов\'язково створіть резервну копію вашого сайту (бази даних та файлів)';
$lang['clone_instances_warning'] = 'Всі налаштування буде скопійовано, окрім дозволів, які потрібно буде встановити вручну.';
$lang['installed_instances'] = 'Встановлені екземпляри';
$lang['instance_name'] = 'Назва екземпляру';
$lang['instance_friendlyname'] = 'Гарне ім\'я';
$lang['instance_smarty'] = 'Теґ Smarty';
$lang['instance_version'] = 'Версія';
$lang['instance_upgrade'] = 'Оновити версію';
$lang['instance_uptodate'] = 'Оновити';
$lang['instance_moduleupgraded'] = 'Оновлено версію модуля';
$lang['copy_title'] = 'Дублювати модуль';
$lang['import_from_LI2_title'] = 'Імпортувати екземпляри з ListIt2';
$lang['prompt_import_from_LI2'] = 'Імпортувати з існуючих екземплярів ListIt2';
$lang['button_import_from_LI2'] = 'Імпортувати!';
$lang['fix_import_from_LI2_title'] = 'Полагодьте імпортовані таблиці ListIt2';
$lang['fix_LI2_instances_warning'] = 'Використовуйте, якщо у вас виникли проблеми з додаванням або редагуванням елементів чи полів у екземплярах, імпортованих з ListIt2!';
$lang['prompt_fix_import_from_LI2'] = 'Спробуйте полагодити таблиці, імпортовані з екземплярів ListIt2';
$lang['button_fix_import_from_LI2'] = 'Полагодити!';
$lang['submit'] = 'Відправити';
$lang['default'] = 'За замовчуванням';
$lang['cancel'] = 'Скасувати';
$lang['update'] = 'Оновити';
$lang['repair'] = 'Відремонтувати';
$lang['save_create'] = 'Зберегти & Створити';
$lang['reset'] = 'Скинути до значень за замовчуванням';
$lang['duplicate'] = 'Створити екземпляр';
$lang['changessaved'] = 'Ваші зміни успішно збережено.';
$lang['changessaved_create'] = 'Ваш попередній елемент успішно збережено. Створити новий?';
$lang['templaterestored'] = 'Шаблон за замовчуванням відновлено.';
$lang['areyousure'] = 'Ви впевнені, що хочете видалити?';
$lang['up'] = 'Вверх';
$lang['down'] = 'Вниз';
$lang['edit'] = 'Редагувати';
$lang['copy'] = 'Копіювати';
$lang['delete'] = 'Видалити';
$lang['nosuchid'] = 'Не знайдено такого ID';
$lang['deleted'] = 'Елемент(и) успішно видалено.';
$lang['add'] = 'Додати %s';
$lang['import'] = 'Імпортувати %s';
$lang['export'] = 'Експортувати %s';
$lang['clone'] = 'Дублювати %s';
$lang['export_title'] = 'Експортувати';
$lang['import_title'] = 'Імпортувати';
$lang['clone_title'] = 'Дублювати';
$lang['alias'] = 'Псевдонім';
$lang['alias_duplicate'] = 'Псевдонім недійсний. Кожен псевдонім має бути унікальним';
$lang['alias_invalid'] = 'Псевдонім недійсний. Він повинен починатися з літери і включати лише літери, цифри та знаки підкреслення';
$lang['search'] = 'Пошук';
$lang['searchfor'] = 'Шукати';
$lang['searchresultsfor'] = 'Результати пошуку для';
$lang['firstpage'] = '<<';
$lang['prevpage'] = '<';
$lang['nextpage'] = '>';
$lang['lastpage'] = '>>';
$lang['module_name'] = 'Назва модуля';
$lang['module_name_empty'] = 'Не заповнено назву модуля';
$lang['module_name_invalid'] = 'Назва модуля містить недійсні символи';
$lang['modulecopied'] = 'Модуль успішно скопійовано';
$lang['select_one'] = 'Виберіть одне';
$lang['size'] = 'Розмір';
$lang['max_length'] = 'Максимальна довжина';
$lang['wysiwyg'] = 'Візуальний редактор';
$lang['date_format'] = 'Формат дати';
$lang['time_format'] = 'Формат часу';
$lang['format_type'] = 'Формат';
$lang['dir'] = 'Тека';
$lang['allowed'] = 'Дозволено';
$lang['exclude_prefix'] = 'Виключити префікс';
$lang['image'] = 'Зображення';
$lang['file'] = 'Файл';
$lang['required'] = 'Обов\'язкове';
$lang['ascending'] = 'За зростанням';
$lang['descending'] = 'За спаданням';
$lang['extra'] = 'Додатково';
$lang['combined'] = 'Комбіновано';
$lang['show_seconds'] = 'Показувати секунди';
$lang['value'] = 'Значення';
$lang['width'] = 'Ширина';
$lang['min_value'] = 'Мінімальне значення';
$lang['max_value'] = 'Максимальне значення';
$lang['increment_by'] = 'Збільшити на';
$lang['subtype'] = 'Підтипи';
$lang['showall'] = 'Показати все';
$lang['columns'] = 'Стовпці';
$lang['owner'] = 'Власник';
$lang['untitled'] = 'без назви';
$lang['filename'] = 'Назва файлу';
$lang['enclosure'] = 'Вкладення';
$lang['separator'] = 'Роздільник';
$lang['values'] = 'Значення';
$lang['import_alias'] = 'Псевдонім елемента/поля';
$lang['file_alias'] = 'Заголовок файлу/псевдонім';
$lang['error_optionrequired'] = 'Параметр %s обов\'язковий';
$lang['error_bad_extension'] = 'Файл, який ви намагаєтеся вивантажити, має непідхоже розширення';
$lang['error_file_permissions'] = 'Виникла проблема з правами доступу до файлів';
$lang['error_file_empty'] = 'Файл не вказано';
$lang['error_file_nocsv'] = 'Файл не є файлом CSV';
$lang['filter'] = 'Фільтр';
$lang['filterprompt'] = 'Фільтрувати %s';
$lang['param_filter_missing'] = 'Параметр <em>filter</em> потрібен у режимі фільтра (filter mode).';
$lang['all'] = 'Всі';
$lang['eventdesc_PreItemSave'] = 'Надіслано перед початком процесу збереження елемента. Можете маніпулювати даними елемента.';
$lang['eventdesc_PostItemSave'] = 'Надіслано після завершення процесу збереження елемента. Можете маніпулювати даними елемента.';
$lang['eventdesc_PreItemDelete'] = 'Надіслано перед початком процесу видалення елемента. Можете маніпулювати даними елемента.';
$lang['eventdesc_PostItemDelete'] = 'Надіслано після завершення процесу видалення елемента. Можете маніпулювати даними елемента.';
$lang['eventdesc_PreItemLoad'] = 'Надіслано перед початком завантаження елемента. Можете маніпулювати даними елемента.';
$lang['eventdesc_PostItemLoad'] = 'Надіслано після завершення процесу завантаження елемента. Можете маніпулювати даними елемента.';
$lang['eventdesc_PreRenderAction'] = 'Надіслано на виконання дії. Можете маніпулювати даними запиту.';
$lang['eventhelp_PreItemSave'] = '<p>Надіслано перед початком процесу збереження елемента. Можете маніпулювати даними елемента.</p>
<h4>Параметри</h4>
<ul>
<li>\'item_object\' - Посилання на об\'єкт елемента, над яким виконана дія.</li> 
</ul>';
$lang['eventhelp_PostItemSave'] = '<p>Надіслано після завершення процесу збереження елемента. Можете маніпулювати даними елемента.</p>
<h4>Параметри</h4>
<ul>
<li>\'item_object\' - Посилання на об\'єкт елемента, над яким виконана дія.</li> 
</ul>';
$lang['eventhelp_PreItemDelete'] = '<p>Надіслано перед початком процесу видалення елемента. Можете маніпулювати даними елемента.</p>
<h4>Параметри</h4>
<ul>
<li>\'item_object\' - Посилання на об\'єкт елемента, над яким виконана дія.</li> 
</ul>';
$lang['eventhelp_PostItemDelete'] = '<p>Надіслано після завершення процесу видалення елемента. Можете маніпулювати даними елемента.</p>
<h4>Параметри</h4>
<ul>
<li>\'item_object\' - Посилання на об\'єкт елемента, над яким виконана дія.</li> 
</ul>';
$lang['eventhelp_PreItemLoad'] = '<p>Надіслано перед початком завантаження елемента. Можете маніпулювати даними елемента.</p>
<h4>Parameters</h4>
<ul>
<li>\'item_object\' - Посилання на об\'єкт елемента, над яким виконана дія.</li> 
</ul>';
$lang['eventhelp_PostItemLoad'] = '<p>Надіслано після завершення процесу завантаження елемента. Можете маніпулювати даними елемента.</p>
<h4>Параметри</h4>
<ul>
<li>\'item_object\' - Посилання на об\'єкт елемента, над яким виконана дія.</li> 
</ul>';
$lang['eventhelp_PreRenderAction'] = '<p>Надіслано на виконання дії. Можете маніпулювати даними запиту.</p>
<h4>Параметри</h4>
<ul>
<li>\'action_name\' - Назва виконаної дії.</li>
<li>\'query_object\' - Посилання на об\'єкт запиту, над яким виконана дія.</li> 
</ul>';
$lang['moddescription'] = 'LISE дозволяє створювати списки, які ви можете відображати на своєму веб-сайті.';
$lang['postinstall'] = 'успішно встановлено';
$lang['postuninstall'] = 'успішно деінстальовано';
$lang['general'] = 'Загальна';
$lang['usage'] = 'Використання';
$lang['permissions'] = 'Дозволи';
$lang['duplicating'] = 'Створення екземплярів';
$lang['upgrading'] = 'Оновлення версії';
$lang['importing'] = 'Імпорт з екземплярів ListItExtended';
$lang['smarty_plugins'] = 'Плаґіни Smarty';
$lang['upgrade_from'] = 'Оновлення з';
$lang['importing_from_li2'] = 'Імпорт з екземплярів ListIt2';
$lang['team'] = 'Команда';
$lang['help_general'] = '<h3>Загальна інформація</h3>
    <p>Якщо стисло, LISE дозволяє створювати списки, які ви можете показувати на своєму веб-сайті. Ви можете просто зробити ЧаПи або функцію "Відгуки" з цим модулем. Веб-розробник може визначати поля, щоб обмежити дані, які може ввести клієнт. Можна вказати ряд типів полів - поле для тексту, прапорець, область тексту, вибір дати, завантажити файл, вибрати файл, випадаючий список - і можна встановити додаткові інструкції для кожного типу, наприклад, розмір поля введення, максимальна довжина, візуальний редактор, можливі випадаючі значення, можливі розширення файлів, шляхи до тек для вибору файлів, формати дати та ін.</p>
    <p>Важливе попередження - Це не модуль для конструктора контенту, як у Drupal. Він призначений для невеликих списків, а не для зберігання тисяч записів. Це пов\'язано з використанням моделі бази даних (EAV). Крім того, кожна частина даних, яку ви вводите, зберігається як тип даних TEXT, незалежно від того, чи це varchar, boolean, timestamp, тощо.</p>
    <div class="red">Ви можете імпортувати екземпляри з ListItExtended. Якщо він у вас встановлений, ви побачите вкладку, <strong>Імпорт з екземплярів ListItExtended</strong>, з додатковою інформацією...</div>';
$lang['help_usage'] = '<h3>Використання</h3>
    
    <p>Ви можете налаштувати {$module_name} тут: Вміст » {$module_name}</p>
    <p>Помістіть цей теґ на свою сторінку: {{$module_name}}</p><br />';
$lang['help_usage_options'] = 'Після встановлення модуля, наступне, що потрібно зробити, - встановити параметри.
     <ol>
         <li>Щоб змінити назву модуля в меню, змініть назву "Гарне ім\'я модуля".</li>
         <li>Щоб змінити назву вкладки з елементами, змініть параметр "Елемент в множині".</li>
     </ol>';
$lang['help_usage_fielddefs'] = 'Далі - встановити типи полів. 
     <ol>
         <li> Виберіть "Поле для тексту", "Прапорець", "Текстова область", "Вибрати дату", "Вибрати файл", "Сторінки" & "Випадаючий список". </li>
         <li> Для кожного поля ви можете вказати або вибрати додаткові параметри <br /> з доступних опцій, які залежать від типу поля. </li>
         <li> Кожен елемент у кожному списку має три поля за замовчуванням. <br /> Всі поля, визначені тут, є додатковими. </li>
     </ol>';
$lang['help_usage_categories'] = 'Щоб мати можливість використовувати категорії з вашим екземпляром LISE, вам доведеться створити поле типу "Категорія". <br /> Після створення цьго поля нова вкладка з назвою "Категорії" стане доступною у вашому модулі LISE.<br/>
	 Тепер ви можете додавати категорії.';
$lang['help_usage_items'] = 'Тепер перейдемо до самого списку елементів. У цьому прикладі він називається"Add Box", його перейменовано у вкладці "Параметри".
     <ol>
         <li> Перше поле є полем за замовчуванням "Заголовок". </li>
         <li> Випадаючий список "Категорія" також є полем за замовчуванням, і якщо його не змінювати, буде встановлено "Загальна".</li>
         <li> Третім полем за замовчуванням є прапорець "Активний". Це дозволяє перемикати статус елемента у списку, не видаляючи його.</li>
     </ ol>';
$lang['help_permissions'] = '<h3>Дозволи</h3> 
     <p> Ви можете вказати наступні дозволи в розділі Користувачі & Групи → Дозволи групи</p>
     <ul>
        <li>{$module_name}: Modify Items</li>
        <li>{$module_name}: Modify all items</li>
        <li>{$module_name}: Remove items</li>
        <li>{$module_name}: Approve items</li>
        <li>{$module_name}: Modify Categories</li>
        <li>{$module_name}: Modify Options</li>
    </ul>
     <p> Щоб дозволити користувачам, які не є адміністраторами, завантажувати файли, перейдіть до Розширення > GBFilePicker і поставте прапорець поруч із пунктом "Show filemanagement options". </p>';
$lang['help_fielddefs'] = '<h3>Типи полів</h3>
    <p>Перше, що потрібно налаштувати, - це ваші типи полів.</p>
    <p>Для кожного поля ви можете вказати додаткові параметри, вибравши з доступних опцій.</p>
    
    <h3>Типи полів за замовчуванням</h3>
    <ul>
      <li>BackendText - <strong>Текст в адмін. панелі</strong>;</li>
      <li>Categories - <strong>Категорії</strong>;</li>
      <li>Checkbox - <strong>Прапорець</strong>;</li>
      <li>CheckboxGroup - <strong>Група прапорців</strong>;</li>
      <li>ColorPicker - <strong>Поле вибору кольору</strong>;</li>
      <li>ContentPages - <strong>Сторінки</strong>;</li>
      <li>CoreFilePicker - <strong>Поле вибору файлу (1) <span style="color:green">(new)</span></strong>;</li>
      <li>CustomFromUDT - <strong>Додаткове поле з теґу користувача (UDT)</strong>;</li>
      <li>Dropdown - <strong>Випадаючий список</strong>;</li>
      <li>FEUDropdown - <strong>Випадаючий список FrontEndUsers (2)(6) <span style="color:orange">(застарілий)</span></strong>;</li>
      <li>FEUMultiSelect - <strong>Поле мульти-вибору FEU (2)</strong>;</li>
      <li>FEUSingleSelect - <strong>Поле вибору одного FEU (2)</strong>;</li>
      <li>FileUpload - <strong>Поле вивантаження файлу</strong>;</li>
      <li>GalleryDropdown - <strong>Випадаючий список для вибору галереї (3)</strong>;</li>
      <li>GBFilePicker - <strong>Поле вивантаження файлу GBFilePicker (4)(6) <span style="color:orange">(застарілий)</span></strong>;</li>
      <li>JMFilePicker - <strong>Поле вивантаження файлуJMFilePicker (5)</strong>;</li>
      <li>JQueryMultiSelect - <strong>Поле мульти-вибору JQuery</strong>;</li>
      <li>LISEInstance - <strong>Екземпляр модуля LISE</strong>;</li>
      <li>LISEInstanceItem - <strong>Елемент екземпляру модуля LISE</strong>;</li>
      <li>MultiSelect - <strong>Поле мульти-вибору</strong>;</li>
      <li>RadioGroup - <strong>Група радіо-кнопок</strong>;</li>
      <li>SelectDateTime - <strong>Вибрати дату та час</strong>;</li>
      <li>SelectFile - <strong>Вибрати файл</strong>;</li>
      <li>Slider - <strong>Повзунок</strong>;</li>
      <li>Tabs - <strong>Вкладки</strong>;</li>
      <li>Tags - <strong>Теґи</strong>;</li>
      <li>TextArea - <strong>Текстова область</strong>;</li>
      <li>TextInput - <strong>Поле для тексту</strong>;</li>
    </ul>
    <div class="information"><strong>Примітка: цей список не включає додаткові поля, які можуть бути зареєстровані зовнішніми модулями.</strong></div>
    <div class="information"><strong>Примітка: після оновлення LISE або встановлення модуля, який міг би зареєструвати додаткові поля, перескануйте поля для їх появи в списку доступних типів полів.</strong></div>
    <p>(1) Має залежності: <strong>File Picker (core)</strong>;</p>
    <p>(2) Має залежності: <strong>FrontEndUsers</strong> і <strong>CGExtensions</strong>;</p>
    <p>(3) Має залежності: <strong>Gallery</strong>;</p>
    <p>(4) Має залежності: <strong>GBFilePicker</strong>. <em>Примітка: Працює лише з CMSMS 1.x </em>;</p>
    <p>(5) Має залежності: <strong>JMFilePicker</strong>.</p>
    <p>(6) Застарілий: <strong>буде видалено в найближчому майбутньому, використовуйте замінники якомога швидше</strong>.</p>';
$lang['help_importing_from_li2'] = '<div class="red">
      <ul>
        <li>
          Ця вкладка відображатиметься лише тоді, якщо наявні дійсні екземпляри ListItExtended на поточному сайті. 
        </li>
        <li>
          <strong>Перш ніж вжити будь-які подальші дії, переконайтеся, що ви створили повну резервну копію вашого сайту та бази даних.</strong>
        </li>
      </ul>
    </div>
    <h4>Крок 1</h4>
    <p>Якщо в системі є дійсні екземпляри ListItExtended, LISE зможе їх виявляти, і там з\'явиться кнопка на основному модулі LISE, на вкладці Пітримка - Імпортування екземплярів з ListIt2. Ця кнопка імпорту повинна робити копію всіх встановлених екземплярів ListIt2, не змінюючи оригінальних. Однак, на даному етапі LISE не копіює дозволи користувачів з ListIt2, оскільки така можливість відсутня у CMSMS Core API. Це має бути зроблено вручну.</p>
    <p>Шаблони, можливо, треба буде налаштувати для роботи з LISE.</p>
    <h4>Крок 2</h4>
    <p>Після того як ви отримаєте копії екземплярів LISE, вам потрібно буде змінити виклик теґів з <strong>{ListIt2‹instance_name›}</strong> на <strong>{LISE‹instance_name›}</strong> на кожному шаблоні, де їх викликають.</p>
    <h4>Крок 3</h4>
    В ідеалі, ваші типи полів повинні знову працювати, якщо це не так, то вам слід спробувати відновити поля з бази даних, натиснувши кнопку «Відновити» на вкладці «Підтримка».</p><br />
    <p><strong>Якщо ви виконали наведені вище кроки, ви повинні отримати повнофункціональний та оновлений модуль LISE та всі створені екземпляри.</strong></p>
    <p><strong>Після цього ви можете видалити екземпляри ListIt2 та ListItExtended самостійно (переконайтеся, що ви зберегли повну резервну копію, на всяк випадок).</strong></p>';
$lang['help_categories'] = '<h3>Категорії</h3>
    <p>Категорії є одним з типів полів і відключені за замовчуванням.<br />
    Якщо вам потрібні Категорії з цим екземпляром, вам доведеться створити нове поле типу "Категорія".<br />
    Після створення поля нова вкладка з назвою "Категорії" з\'явиться та стане доступною в екземплярі модуля.</p>
    <p>Категорії підтримують кілька рівнів, і створювані елементи можуть належати до кількох категорій залежно від вибраних параметрів при створенні поля "Категорія".</p><br />
    <p>Існує два зразки шаблонів, які демонструють, як працюють категорії в рамках роботи екземплярів модулів LISE, це дасть вам початкове уявлення про те, як створити свої персоналізовані шаблони для вашого наступного проекту.</p>
    <h4>Використання категорій</h4>
    <p>Для детального використання та доступних параметрів див. нижче в розділі Довідки "Параметри"</p>
    <pre><code>{{$module_name} action=\'category\'}</code></pre>';
$lang['help_templates'] = '<h3>Шаблони</h3>
    <p>Якщо ви не впевнені, які змінні можна використовувати у ваших шаблонах, спробуйте відлагодити:</p> 
    <p>{{$module_name} debug=1}</p>
    <p>Ви можете отримати доступ до будь-якого поля безпосередньо при переборі елементів за допомогою псевдоніму поля, наприклад, якщо ви створили поле з псевдонімом "position", ви можете виконати одну з таких дій:</p>';
$lang['help_duplicating'] = '<h3>Створення екземплярів модуля</h3>
    <p>Цей модуль - Панель управління для створення екземплярів модуля LISE. Щоб створити модуль LISE, просто перейдіть на вкладку "Екземпляри" та натисніть кнопку "Створити екземпляр".<br />
    Переконайтеся, що ви дотримуєтесь правил щодо введення назв модулів CMSMS, a-z без будь-яких знаків пунктуації або пробілів, щоб все було добре :)<br /> 
    Ви можете встановити екземпляру <strong>Гарне ім\'я</strong>, <strong>Опис керування модулем</strong> і <strong>Розділ адмін. панелі, в якому розміщено модуль</strong> у формі <strong>Створити екземпляр</strong>.<br />
    Після створення модуля буде встановлено новий екземпляр і поміщено в оригінальний модуль LISE у вкладці "Екземпляри".</p><br /> 
    <p>Ви завжди можете змінити гарне ім\'я модуля після встановлення в розділі "Параметри"(Вміст » LISEНазвамодуля).<br />
    Щоб змінити піктограму, замініть /modules/LISEНазвамодуля/images/icon.gif.<br />
    Щоб змінити розділ адмін. панелі, в якому буде модуль, просто виберіть відповідний розділ з випадаючого списку. Після цих змін переконайтеся, що ви очистили кеш.</p>';
$lang['help_smarty_plugins'] = '<h4>Дія:</h4>
	 <p>Цей плаґін дозволяє завантажувати елемент LISE та об\'єкт категорії за певними критеріями в будь-якій точці системи.</p> 
	 
	<h4>Використання:</h4>
	<p>Просто вставте цей теґ на свою сторінку або шаблон:</p>
	<pre><code>{LISELoader item=\'item\' identifier=\'alias\' instance=\'LISEInstance\' value=\'myalias\' assign=\'tmp\'}</code></pre>
	
	<p> </p>
	
	<p>Наступний рядок буде завантажувати об\'єкт елемента з екземпляру "LISEInstance" за псевдонімом "myalias" і призначати його змінній &dollar;tmp. <br /> 
	Після цього ви можете використовувати його аналогічним чином, як і в звичайних шаблонах LISE:</p>
	<pre><code>{&dollar;tmp->title}</code></pre>
	
	<p> </p>
	
	<p>Якщо завантажується декілька елементів, ця функція повертає масив об\'єктів, в іншому випадку він повертає окремий об\'єкт елемента/категорії</p>

	<h4>Який параметр він приймає?</h4>
	<ul>
		<li><em>(required) </em><tt>instance</tt> - Назва екземпляра, що містить елементи.<i>(Якщо використовується всередині шаблонів LISE, цей параметр є необов\'язковим)</i></li>
		<li><em>(required) </em><tt>value</tt> - Перелік значень ідентифікатора через кому: \'alias1,alias2,alias3\' або \'1,2,3\'</li>
		<li><em>(optional) </em><tt>item="item"</tt> - Потрібний тип елемента: елемент/категорія</li>
		<li><em>(optional) </em><tt>identifier="item_id/category_id"</tt> - Потрібний ідентифікатор, один з наступних: item_id, category_id, alias</li>
		<li><em>(optional) </em><tt>force_array="false"</tt> - Виводити у вигляді масиву</li> 
	</ul>';
$lang['help_param_action'] = 'Перевизначити дію за замовчуванням. Можливі значення:
    <ul>
        <li>"default" - відображати список елементів.</li>
        <li>"detail" - відображати вибраний елемент у детальному режимі.</li> 
        <li>"search" - відображати форму пошуку. Додаткові параметри, які впливають лише на цю дію: <em>filter.</em></li>
        <li>"category" - відображати категорії. Додаткові параметри, які впливають лише на цю дію: <em>show_items, collapse, number_of_levels.</em></li>
        <li>"archive" - відображати архіви. </li>
    </ul>';
$lang['help_param_showall'] = 'Показати всі елементи незалежно від дати завершення.';
$lang['help_param_category'] = 'Вкажіть псевдонім категорії або псевдоніми категорій через кому, членами яких повинні бути відображені елементи';
$lang['help_param_exclude_category'] = 'Вкажіть псевдонім категорії або псевдоніми категорій через кому, членами яких не повинні бути відображені елементи';
$lang['help_param_subcategory'] = 'Якщо вказано параметр "category", цей параметр, встановлений на <em>true</em>, буде враховувати елементи підкатегорій. За замовчуванням встановлено значення "false".';
$lang['help_param_detailtemplate'] = 'Шаблон виводу елемента, який ви хочете використовувати.';
$lang['help_param_summarytemplate'] = 'Шаблон списку елементів, який ви хочете використовувати.';
$lang['help_param_searchtemplate'] = 'Шаблон для пошуку, який ви хочете використовувати.';
$lang['help_param_categorytemplate'] = 'Шаблон категорій, який ви хочете використовувати.';
$lang['help_param_orderby'] = 'Ви можете упорядкувати за будь-яким з наступних стовпців: item_id, item_title, item_position, item_created, category_id, category_name, category_position, category_hierarchy, rand, а також додаткові поля з custom_ * (* буде псевдонімом поля).
<p>Наприклад:</p>
    <ul>
        <li>orderby=\'category_name, item_title\'</li>
        <li>
          <p>За значеннями полів:</p> 
          orderby=\'custom_[fielddef alias]\'
        </li>
        <li>
          <p>Ви також можете вказати сортування за зростанням або за спаданням для будь-якого стовпця, наприклад:</p>
          orderby=\'category_name|ASC, item_title|DESC\'
        </li>
    </ul>';
$lang['help_param_pagelimit'] = 'Максимальна кількість елементів для виводу (на сторінці). Якщо параметр не вказано, то буде показано всі елементи. Якщо вказано і значення є меншим за кількість елементів, то буде виведено сторінки "вперед", "назад", які дозволять побачити всі елементи.';
$lang['help_param_start'] = 'Почати з n-го елемента - якщо поле порожнє, то буде показано з першого елемента.';
$lang['help_param_number'] = 'Максимальна кількість статей для виводу (на сторінці) -- якщо поле порожнє, то буде показано всі елементи. Це синонім до параметра pagelimit';
$lang['help_param_detailpage'] = 'Сторінка для відображення деталей елемента. Має бути псевдонім/id сторінки. Дозволяє переглянути детальні дані на сторінці, відмінній від сторінки, на якій виведено список елементів.';
$lang['help_param_summarypage'] = 'Сторінка для виводу списку елементів. Повинен бути псевдонім/id сторінки. Дозволяє відображати список на іншій сторінці, ніж початкова (де був теґ LISEНазвамодуля).';
$lang['help_param_item'] = 'Цей параметр застосовується лише для виводу елемента. Він дозволяє вказати, який елемент відображати в детальному режимі. Повинен бути псевдонім елемента.';
$lang['help_param_search'] = 'Шукати всі поля. Використовує пошук <strong>fulltext</strong>. Можна поєднувати з пошуком фільтра.';
$lang['help_param_search_'] = 'Шукати в певному полі. Ви можете використовувати \'title\' або псевдонім поля, наприклад search_title. Можна об\'єднати з повнотекстовим пошуком. Параметри декількох пошукових налаштувань search_* можуть бути об\'єднані.';
$lang['help_param_filter'] = 'Застосовується лише до дії: <em>search</ em>. Вказує поля, значення яких повинні бути запропоновані як параметри фільтру, вказавши псевдоніми полів через кому.';
$lang['help_param_filter_order_by'] = 'При фільтрації в пошуковій дії ви можете упорядкувати за будь-яким з наступних стовпців: value, item_id, alias, title, position, create_time і modified_time. 
<p>Використання подібне до параметру <em>orderby</em>. Також для цього потрібен параметр <em>filter</em>.</p>
<p>Порядок списку псевдонімів через кому використовується для визначення порядку їх застосування у фільтрації <em>filterorderby</em>.</p>
<p>Наприклад:</p>
    <ul>
      <li>filter=\'[fielddef alias]\' filterorderby=\'value|ASC\' (поведінка за замовчуванням, тому <em>filterorderby</em> можна пропустити в цьому випадку)</li> 
      <li>
        <p>З кількома псевдонімами, щоб відсортувати по-іншому:</p>
        <p>filter=\'[fielddef alias],[another fielddef alias]\' filterorderby=\'title,value|DESC\' (ASC за замовчуванням, тому його можна пропустити)</p>
        <p>Ця дія буде сортувати випадаючі списки фільтра або мульти-вибір полів за назвою ASC і за значенням DESC відповідно</p>
      </li>
    </ul>';
$lang['help_param_debug'] = 'Вмикає режим відлагодження, виводить всі об\'єкти, масиви, змінні, доступні для поточної дії.';
$lang['help_param_collapse'] = 'Застосовується лише до дії: <em>category</em>. Переключає згортання/розгортання категорій.';
$lang['help_param_show_items'] = 'Застосовується лише до дії: <em>category</em>. Додає елементи до дерева категорій.';
$lang['help_param_number_of_levels'] = 'Застосовується лише до дії: <em>category</em>. Глибина рівнів категорій для виводу.';
$lang['help_param_include_items'] = 'Вкажіть id/псевдонім або id/псевдоніми елементів через кому, які ви хочете відобразити.';
$lang['help_param_exclude_items'] = 'Вкажіть id/псевдонім або id/псевдоніми елементів через кому, які ви хочете виключити зі списку.';
$lang['help_param_year'] = 'Фільтрувати елементи за роком.';
$lang['help_param_month'] = 'Фільтрувати елементи за місяцем.';
$lang['importing_warning'] = '<h3> Важлива інформація </h3>
     <p> <strong> Прочитайте це ретельно!</strong></p>
     <p> Вам потрібно мати екземпляр ListItExtended, оновлений до найновішої версії (1.4.1).<br/>
     Не намагайтеся імпортувати екземпляри ListItExtended без оновлення, оскільки це може призвести до неповних екземплярів LISE.</p>';
$lang['00000'] = '%s: Невідома помилка LISE!';
$lang['00001'] = '%s: Дискретна помилка LISE: %s!';
$lang['00002'] = '%s:Дискретна помилка Бази даних LISE: %s!';
$lang['00010'] = '%s: спроба записати до конфігурації; Конфігурація LISE: ТІЛЬКИ ДЛЯ ЧИТАННЯ!';
?>